import 'Question.dart';

class QuizBrain {
  // اجوبة الاختبار الاول
  static Map<String, Map<String, String>> omar = {
    '1': {
      'a': 'تدخل اللاوعي',
      'b': 'خلل في قدرة المرسل',
      'c': 'التشويش الذاتي',
      'd': 'قصور في التخطيط'
    },
    '2': {'a': 'الانصات', 'b': 'الاستماع', 'c': 'السماع', 'd': 'تواصل'},
    '3': {'a': '5 عناصر', 'b': '4 عناصر', 'c': '6 عناصر', 'd': '8 عناصر'},
    '4': {'a': 'لغوية', 'b': 'نقدية', 'c': 'عقلية', 'd': 'اخلاقية'},
    '5': {'a': 'اللونية', 'b': 'الضوئية', 'c': 'اللغوية', 'd': 'الحرفية'},
    '6': {
      'a': 'مهارة التحدث',
      'b': 'مهارة الكتابة',
      'c': 'مهارة القراءة السليمة',
      'd': 'مهارة الاصغاء الايجابي'
    },
    '7': {'a': 'المرسل', 'b': 'المستقبل', 'c': 'الرسالة', 'd': 'وسيلة الاتصال'},
    '8': {
      'a': 'عدم السرعة اثناء التحدث',
      'b': 'الموضوعية',
      'c': 'الابتكار و التعبير',
      'd': 'نبرة الصوت'
    },
    '9': {
      'a': 'الكذب الادعائي',
      'b': 'الكذب بالعدوى',
      'c': 'الكذب الخيالي',
      'd': 'الكذب المزمن'
    },
    '10': {
      'a': 'افضل في التعبير عن المشاعر',
      'b': 'اقل كلفة',
      'c': 'افضل بالنسبة للرسائل الصعبة و المعقدة',
      'd': 'يجعل التاثير كبير'
    },
    '11': {
      'a': 'التثقيفية',
      'b': 'التربوية',
      'c': 'الاجتماعية',
      'd': 'السياسية'
    },
    '12': {
      'a': 'حذف فقرات او جمل',
      'b': 'تكرار فقرات او جمل',
      'c': 'التقيد بالوقت',
      'd': 'التاكيد على فقرات او جمل'
    },
    '13': {
      'a': 'وضع النهار',
      'b': 'الوجه المستتر',
      'c': 'المنطقة المظلمة',
      'd': 'منطقة المجهول'
    },
    '14': {'a': '25 %', 'b': '17 %', 'c': '35 %', 'd': '22 %'},
    '15': {
      'a': 'مهارة الانتباه',
      'b': 'مهارة الادراك و الاستيعاب',
      'c': 'مهارة تمييز الجمل',
      'd': 'مهارة تذوق و نقد الكلام'
    },
    '16': {
      'a': 'الاستماع لتقديم المساعدة',
      'b': 'الاستماع للهروب من الخطر',
      'c': 'التكيف ذهنيا مع سرعة المتحدث',
      'd': 'الظروف الصحية للمستمع'
    },
    '17': {
      'a': 'عجز في صياغة الرسالة',
      'b': 'استباقه لتكوين الافكار',
      'c': 'قصور التخطيط لعملية الاتصال',
      'd': 'تدخل اللاوعي في عملية الاتصال'
    },
    '18': {'a': 'الاجتماعية', 'b': 'التربوية', 'c': 'السياسية', 'd': 'الدينية'},
    '19': {
      'a': 'امتلاك الاتجاهات الايجابية نحو المستقبل',
      'b': 'القدرة على التقويم',
      'c': 'التحدث',
      'd': 'الذكاء الوظيفي'
    },
    '20': {'a': 'تربوية', 'b': 'فكرية دينية', 'c': 'مالية', 'd': 'تثقيفية'},
    '21': {
      'a': 'مهارات التواصل',
      'b': 'الاعلام',
      'c': 'القدرة',
      'd': 'الاتصال'
    },
    '22': {
      'a': 'اتصال جماهيري',
      'b': 'اتصال وسيطي',
      'c': 'اتصال ذاتي',
      'd': 'اتصال جمعي'
    },
    '23': {
      'a': 'المرسل ',
      'b': 'المستقبل',
      'c': 'المرسل و المستقبل معا',
      'd': 'كل ما سبق خطا'
    },
    '24': {'a': 'الرسالة', 'b': 'المرسل', 'c': 'المستقبل', 'd': 'الوسيلة'},
    '25': {'a': 'الشرح', 'b': 'السيرة', 'c': 'القصة', 'd': 'المحاضرة'},
    '26': {
      'a': 'المهارة العقلية',
      'b': 'لغة الجسد',
      'c': 'الايجابية و المشاركة الفعلية و عدم اظهار السلبية',
      'd': 'القدرة على اختيار قناة الاتصال المناسبة'
    },
    '27': {
      'a': 'الادراك و الاستيعاب',
      'b': 'التمييز و التحليل',
      'c': 'الانتباه',
      'd': 'التذوق و النقد و التقييم'
    },
    '28': {
      'a': 'وسيلة الاتصال الناجح',
      'b': 'وسيلة من وسائل التواصل',
      'c': 'مهارة من مهارات الاتصال',
      'd': 'كل ما سبق صحيح'
    },
    '29': {
      'a': 'مهارة الصوت و التنوع الصوتي',
      'b': 'مهارة اللغة غير المنطوقة',
      'c': 'مهارة اشراك المستمع',
      'd': 'ارتباط الاتصال اللفظي مع غير اللفظي'
    },
    '30': {'a': 'القصرية', 'b': 'النثرية', 'c': 'الذاتية', 'd': 'خاضع للتعميم'},
    '31': {'a': '70 %', 'b': '22 %', 'c': '84 %', 'd': '15 %'},
    '32': {'a': 'التحليلي', 'b': 'الاحصائي', 'c': 'المالي', 'd': 'الاخباري'},
    '33': {
      'a': 'اللعب بالقلم او المؤشر',
      'b': 'درجة الصوت',
      'c': 'الوقوف بثبات و ضرورة المحافظة على الهدوء',
      'd': 'الاستخدام المفرط لبعض الكلمات'
    },
    '34': {'a': 'القصة', 'b': 'العرض', 'c': 'التقرير', 'd': 'الوثيقة'},
    '35': {
      'a': 'التمييز و التحليل',
      'b': 'الادراك والاستيعاب',
      'c': 'التذوق و النقد و التقييم',
      'd': 'الانتباه'
    },
    '36': {'a': '200', 'b': '300', 'c': '500', 'd': '700'},
    '37': {
      'a': 'بالامكان الرجوع اليه',
      'b': 'التغذية العكسية',
      'c': 'استخدام الكلمات الشائعة',
      'd': 'يستطيع المرسل ان يقوم بالتخطيط بشكل جيد قبل القيام بعملية التحويل'
    },
    '38': {'a': '70 %', 'b': '80 %', 'c': '50 %', 'd': '30 %'},
    '39': {
      'a': 'الالتباسي',
      'b': 'الدفاعي',
      'c': 'المزمن',
      'd': 'العدوى بالتقليد'
    },
    '40': {
      'a': 'مقال وصفي',
      'b': 'مقال نقدي',
      'c': 'مقال فلسفسي',
      'd': 'مقال ادبي'
    },
    '41': {'a': '3', 'b': '4', 'c': '5', 'd': '6'},
    '42': {
      'a': 'الجلوس في مكان بعيد عن الضوضاء',
      'b': 'الاستماع لتقديم المساعدة',
      'c': 'ارجاع الاثر',
      'd': 'كل ما سبق خاطئ'
    },
    '43': {'a': 'الشخصية', 'b': 'الصوتية', 'c': 'الاجتماعية', 'd': 'الفنية'},
    '44': {
      'a': 'التكرار لفقرات او جمل',
      'b': 'التحضير و الاعداد الجيد',
      'c': 'التحدث المستمر عن الذات',
      'd': 'سرعة الكلام'
    },
    '45': {
      'a': 'الاعتناء باختيار الكلمة',
      'b': 'مراعاة وحدة الجملة',
      'c': 'التقيد باللغة العربية الفصحى',
      'd': 'مبدأ التكيف'
    },
    '46': {'a': 'المقال', 'b': 'التقرير', 'c': 'النثر', 'd': 'القصر'},
    '47': {
      'a': 'النظر الى كل شخص من الحضور بين فترة و اخرى',
      'b': 'الاستخدام المفرط لبعض الكلمات',
      'c': 'الوقوف بثبات و ضرورة المحافظة على الهدوء',
      'd': 'الاختيار 1 + 3 معا'
    },
    '48': {
      'a': 'التأكيد بواسطة المركز',
      'b': 'التأكيد بواسطة وسائل ميكانيكية',
      'c': 'التأكيد باستخدام وسائل كهربائية',
      'd': 'كل ما سبق خاطئ'
    },
    '49': {
      'a': 'الاخباري',
      'b': 'السنوي',
      'c': 'الاقتصادي',
      'd': 'التحليلي',
    },
    '50': {
      'a': 'معلم و معلم',
      'b': 'معلم و متعلم',
      'c': 'متعلم و متعلم',
      'd': 'كل ما سبق خاطئ'
    },
    '51': {'a': 'المرسل', 'b': 'المستقبل', 'c': 'الرسالة', 'd': 'الوسيلة'},
    '52': {
      'a': 'المتحدث',
      'b': 'الوسيلة ',
      'c': 'الظروف المعنوية و المادية المحيطة',
      'd': 'الرسالة'
    },
    '53': {
      'a': 'المهارة الاخلاقية',
      'b': 'المهارة اللغوية',
      'c': 'الذكاء الوظيفي',
      'd': 'المهارة العقلية'
    },
    '54': {
      'a': 'ان يكون تقويميا',
      'b': 'ان يكون عاما',
      'c': 'ان يكون مطلوبا',
      'd': 'كل ما سبق صحيح'
    },
    '55': {
      'a': 'سرعة الكلام',
      'b': 'الخوف الشديد',
      'c': 'درجة الصوت',
      'd': 'الاختيار 1 + 2 معا'
    },
    '56': {
      'a': 'مهارة القراءة السليمة',
      'b': 'فهم الرسالة و استيعاب مضمونها',
      'c': 'الاصغاء الايجابي',
      'd': 'كل ما سبق صحيح'
    },
    '57': {
      'a': 'الظروف الاجتماعية',
      'b': 'الظروف النفسية',
      'c': 'الظروف الاقتصادية',
      'd': 'الظروف التربوية'
    },
    '58': {'a': 'الانصات', 'b': 'الاستماع', 'c': 'السماع', 'd': 'الاتصال'},
    '59': {
      'a': 'يحدد مضمون افضل لرسالتك',
      'b': 'تحدد الجمهور لرسالتك',
      'c': 'تحديد الهدف من الاتصال',
      'd': 'كيفية النفاذ الى عقل الجمهور'
    },
    '60': {
      'a': 'عملية هادفة',
      'b': 'عملية ديناميكية',
      'c': 'عملية دائرية غير خطية',
      'd': 'عملية منظمة'
    },
    '61': {
      'a': 'ابداء الرأي في قضايا الوطن',
      'b': 'القدرة على التحليل و التركيب',
      'c': 'احساس عام بالمسؤولية',
      'd': 'تمييز الخطأ من الصواب'
    },
    '62': {
      'a': 'المظهر الجيد',
      'b': 'حسن استخدام الوقفات',
      'c': 'استخدام وسائل الايضاح',
      'd': 'اختيار المداة التحدث'
    },
    '63': {'a': '1 مرحلة', 'b': '2 مرحلة', 'c': '3 مرحلة', 'd': '4 مرحلة'},
    '64': {
      'a': 'مهارات التواصل',
      'b': 'الاتصال',
      'c': 'التواصل',
      'd': 'الاتصال الفعال'
    },
    '65': {
      'a': 'سمات صوتية',
      'b': 'سمات شخصية',
      'c': 'سمات فنية',
      'd': 'كل ما سبق صحيح'
    },
    '66': {'a': 'قصة', 'b': 'محاضرة', 'c': 'شرح', 'd': 'حوار'},
    '67': {
      'a': 'شرح',
      'b': 'محاضرة',
      'c': 'شرح و محاضرة',
      'd': 'كل ما سبق خطا'
    },
    '68': {'a': 'فنية', 'b': 'صوتية', 'c': 'شخصية', 'd': 'ثقافية'},
    '69': {
      'a': 'الكذب الدفاعي',
      'b': 'الكذب الانتقامي',
      'c': 'الكذب الادعائي',
      'd': 'الكذب الالتباسي'
    },
    '70': {'a': '3', 'b': '4', 'c': '5', 'd': '6'},
    '71': {'a': 'شرح', 'b': 'سيرة', 'c': 'محاضرة', 'd': 'قصة'},
    '72': {'a': '3', 'b': '4', 'c': '6', 'd': '7'},
    '73': {
      'a': 'اتصال جماهيري',
      'b': 'اتصال جمعي',
      'c': 'اتصال شخصي',
      'd': 'كل ما سبق خطأ'
    },
    '74': {'a': '5', 'b': '6', 'c': '7', 'd': '8'},
    '75': {'a': '3', 'b': '4', 'c': '5', 'd': '6'},
    '76': {'a': 'لازويل', 'b': 'العام', 'c': 'مور', 'd': 'كل ما سبق صحيح'},
    '77': {
      'a': 'الذكاء الوظيفي',
      'b': 'وضوح الرؤية و تحديد الهدف',
      'c': 'تحصيل المعرفة',
      'd': 'القدرة على التعبير'
    },
    '78': {
      'a': 'الاختلافات الاجتماعية و الثقافية',
      'b': 'معوقات بيئية',
      'c': 'اختلاف الجنس',
      'd': 'كل ما سبق صحيح'
    },
    '79': {'a': 'زبائن', 'b': 'مشرفين', 'c': 'مساعدين', 'd': 'كل ما سبق صحيح'},
    '80': {
      'a': 'الرسالة',
      'b': 'المرسل',
      'c': 'المستقبل',
      'd': 'كل ما سبق صحيح'
    },
    '81': {'a': 'التقرير', 'b': 'السيرة', 'c': 'المقال', 'd': 'القصة'},
    '82': {'a': 'المكان', 'b': 'وضع الجسم', 'c': '1 + 2', 'd': 'كل ما سبق خطأ'},
    '83': {'a': 'احصائي', 'b': 'مالي', 'c': 'اشرافي', 'd': 'اخباري'},
    '84': {'a': 'اقتصادي', 'b': 'سنوي', 'c': 'سياسي', 'd': 'مالي'},
    '85': {'a': 'عقلية', 'b': 'لغوية', 'c': 'نقدية', 'd': 'كل ما سبق خطأ'},
    '86': {
      'a': 'الانتباه',
      'b': 'التمييز و التحليل',
      'c': 'النقد و التقييم',
      'd': 'الادراك و لاستيعاب'
    },
    '87': {'a': '22%', 'b': '35%', 'c': '25%', 'd': '17%'},
    '88': {'a': '35%', 'b': '22%', 'c': '17%', 'd': '25%'},
    '89': {'a': '15%', 'b': '17%', 'c': '25%', 'd': '22%'},
    '90': {'a': '15%', 'b': '17%', 'c': '29%', 'd': '20%'},
    '91': {'a': '16', 'b': '4', 'c': '8', 'd': '2'},
    '92': {'a': 'الادبي', 'b': 'العلمي', 'c': 'الفلسفي', 'd': 'الشخصي'},
    '93': {
      'a': 'الوصفي',
      'b': 'الوظيفي',
      'c': 'الابداعي',
      'd': 'كل ما سبق صحيح'
    },
    '94': {
      'a': 'الاتصال بمجموعة كبيرة من الافراد',
      'b': 'تحويل المعلومات لمسافات بعيدة',
      'c': 'الاتصال الشخصي و الفردي',
      'd': '1 + 2'
    },
    '95': {'a': '85%', 'b': '86%', 'c': '87%', 'd': '84%'},
    '96': {
      'a': 'وضع اسهم',
      'b': 'استخدام الالوان',
      'c': 'علامة استفهام',
      'd': 'كل ما سبق صحيح'
    },
    '97': {
      'a': 'الرسالة المكتوبة لا تقود الى نتائج',
      'b': 'تقود الرسالة الى غموض في الافكار',
      'c': 'تتطلب الرسالة اعادة كتابة اكثر من مرة',
      'd': 'كل ما سبق صحيح'
    },
    '98': {'a': 'الرسمي', 'b': 'الاشرافي', 'c': 'الاحصائي', 'd': 'المالي'},
    '99': {
      'a': 'للاخبار عن شيء ما ',
      'b': 'طلب شيء ما',
      'c': 'بناء سمعة جيدة',
      'd': 'كل ما سبق صحيح'
    },
    '100': {'a': '15 دقيقة', 'b': '10 دقيقة', 'c': '20 دقيقة', 'd': '30 دقيقة'},
    '101': {
      'a': 'التواصل',
      'b': 'المهارة',
      'c': 'الاتصال الذاتي',
      'd': 'الاتصال'
    },
    '102': {
      'a': 'الاتصال عملية ديناميكية',
      'b': 'الاتصال عملية هادفة',
      'c': 'الاتصال عملية اجتماعية',
      'd': 'الاتصال عملية منظمة'
    },
    '103': {
      'a': 'معلم و مدير',
      'b': 'معلم و متعلم',
      'c': 'معلم و معلم',
      'd': 'معلم و موجه'
    },
    '104': {
      'a': 'الشخص ذاته',
      'b': 'شخص و شخص اخر',
      'c': 'مجموعة من الاشخاص متجانسين',
      'd': 'مجموعة اشخاص'
    },
    '105': {'a': '5 عناصر', 'b': '6 عناصر', 'c': '8 عناصر', 'd': '7 عناصر'},
    '106': {
      'a': 'الرسالة',
      'b': 'قناة الاتصال',
      'c': 'المستقبل',
      'd': 'المرسل'
    },
    '107': {
      'a': 'عدم وصول الرسالة',
      'b': 'ترميز الرسالة',
      'c': 'الضوضاء',
      'd': 'سوء فهم لدى الشخص نفسه'
    },
    '108': {
      'a': 'اختيار الرسالة',
      'b': 'مدى قبول الرسالة',
      'c': 'صياغة الرسالة',
      'd': 'رموز الرسالة'
    },
    '109': {
      'a': 'وظيفة اجتماعية',
      'b': 'وظيفة تربوية',
      'c': 'وظيفة تثقيفية',
      'd': 'وظيفة فكرية دينية'
    },
    '110': {
      'a': 'التفريغ الانفعالي',
      'b': 'التعليم و التعلم',
      'c': 'في سوق العمل',
      'd': 'بالتدريب المهني'
    },
    '111': {
      'a': 'الاستماع',
      'b': 'السماع',
      'c': 'الانصات',
      'd': 'القراءة السريعة'
    },
    '112': {
      'a': 'تركيز الانتباه',
      'b': 'الاستماع الجيد',
      'c': 'تعتمد على الاصوات المنطوقة لا غير',
      'd': 'لغة الجسد'
    },
    '113': {
      'a': 'استخدام التقنيات الخاصة بالتركيز',
      'b': 'تقييم مضمون الرسالة',
      'c': 'الادراك',
      'd': 'البحث عن المعلومات'
    },
    '114': {
      'a': 'التواصل العيني',
      'b': 'مهارات الادراك و الاستيعاب',
      'c': 'لغة الجسد',
      'd': 'التواصل غير اللفظي'
    },
    '115': {
      'a': 'عدم التركيز',
      'b': 'الانانية',
      'c': 'الكذب',
      'd': 'التفكير السريع'
    },
    '116': {
      'a': 'التركيز على اللغة',
      'b': 'التعبيرات الوجهية',
      'c': 'التركيز على التفاصيل',
      'd': 'التركيز على اللهجة'
    },
    '117': {
      'a': 'تلافي العوامل المشتتة للانتباه',
      'b': 'الكذب',
      'c': 'الاستعانة باشخاص اخرين',
      'd': 'اسلوب المرسل'
    },
    '118': {
      'a': 'ذكر اسماء اشخاص الحوار',
      'b': 'ترتيب المشاعر التي اثارها الحوار',
      'c': 'توضيح المشاعر',
      'd': 'كل ما ذكر صحيح'
    },
    '119': {
      'a': 'يكتب ما يعادل كتابا كل شهر',
      'b': 'يكتب ما يعادل كتابا كل عام',
      'c': 'يكتب ما يعادل كتابا كل شهرين',
      'd': 'يكتب كل ما يعادل كتابا كل 3 اشهر'
    },
    '120': {'a': '25 %', 'b': '30 %', 'c': '18 %', 'd': '50 %'},
    '121': {
      'a': 'الطريقة',
      'b': 'التخلص من المشتتات الشعورية و اللاشعورية',
      'c': 'الاستراتيجية',
      'd': 'الاسلوب'
    },
    '122': {'a': 'التقليدي', 'b': 'التفاعلي', 'c': 'النشط', 'd': 'التشاركي'},
    '123': {
      'a': 'نظرية',
      'b': 'عملية',
      'c': 'نظرية و عملية',
      'd': 'قابلة للقياس و الملاحظة'
    },
    '124': {
      'a': 'التقيد بالوقت',
      'b': 'التحضير الجيد',
      'c': 'الدقة العلمية',
      'd': 'عدم حجب الرؤية عن الحضور'
    },
    '125': {
      'a': 'التكرار لفقرات و جمل',
      'b': 'التكرار لكلمات محددة',
      'c': 'التاكيد على فقرات او جمل',
      'd': 'حذف فقرات او جمل'
    },
    '126': {
      'a': 'سرعة الكلام',
      'b': 'البطء في الكلام',
      'c': 'الدقة في الكلام',
      'd': 'عدم التوتر في الكلام'
    },
    '127': {
      'a': 'قلد الاخرين',
      'b': 'لا تحاول تقليد الاخرين',
      'c': 'نمذج الاخرين',
      'd': 'تقمص شخصية الاخرين'
    },
    '128': {
      'a': 'البطء في العرض',
      'b': 'العرض المرئي',
      'c': 'البساطة',
      'd': 'سرعة العرض'
    },
    '129': {
      'a': 'الوضعية',
      'b': 'اللغة الطبيعية',
      'c': 'اللغة الاجتماعية',
      'd': 'لغة الجسد'
    },
    '130': {
      'a': 'الالفاظ المقبولة مهنيا',
      'b': 'الالفاظ المقبولة اقتصاديا',
      'c': 'الالفاظ المقبولة تعليميا',
      'd': 'الالفاظ المقبولة تربويا'
    },
    '131': {
      'a': 'بادر بالتحية',
      'b': 'قدم نفسك بواقعية',
      'c': 'خاطب محدثك باسمه',
      'd': 'كل ما سبق صحيح'
    },
    '132': {
      'a': 'اقل الطرق تكلفة و جهد',
      'b': 'سرعة الكلام',
      'c': 'التحدث بالتفاصيل الدقيقة',
      'd': 'التركيز على التفاصيل'
    },
    '133': {
      'a': 'سمات عمرية',
      'b': 'سمات صوتية',
      'c': 'سمات دينية',
      'd': 'سمات علمية'
    },
    '134': {'a': 'الشرح', 'b': 'التلقين', 'c': 'المحاضرة', 'd': 'الاستنتاج'},
    '135': {
      'a': 'القلق',
      'b': 'انزيم الادرينالين',
      'c': 'عدم الاهتمام',
      'd': 'عدم الرغبة بالالقاء'
    },
    '136': {'a': '55 %', 'b': '84 %', 'c': '36 %', 'd': '70 %'},
    '137': {
      'a': 'التكرار',
      'b': 'اللغة',
      'c': 'لغة الجسد',
      'd': 'مهارة التواصل'
    },
    '138': {
      'a': 'الاعلام المضلل',
      'b': 'الخذلان',
      'c': 'الاشاعة',
      'd': 'الكذب'
    },
    '139': {
      'a': 'الكذب الالتباسي',
      'b': 'الغش',
      'c': 'الكذب بالعدوى',
      'd': 'العقدة النفسية'
    },
    '140': {
      'a': 'الكذب المزمن و اللاشعوري',
      'b': 'الكذب المتناقض',
      'c': 'الكذب الادعائي',
      'd': 'الكذب الخيالي'
    }
  };

  //correct answers
  static List<String> ans = [
    'c',
    'c',
    'd',
    'b',
    'b',
    'a',
    'b',
    'b',
    'd',
    'c',
    'c',
    'b',
    'b',
    'b',
    'b',
    'c',
    'd',
    'b',
    'c',
    'c',
    'b',
    'a',
    'd',
    'c',
    'b',
    'c',
    'c',
    'b',
    'b',
    'd',
    'c',
    'c',
    'c',
    'c',
    'c',
    'c',
    'b',
    'a',
    'a',
    'b',
    'b',
    'c',
    'c',
    'b',
    'c',
    'b',
    'd',
    'c',
    'c',
    'b',
    'a',
    'b',
    'c',
    'c',
    'b',
    'b',
    'b',
    'b',
    'a',
    'c',
    'a',
    'd',
    'b',
    'b',
    'd',
    'b',
    'c',
    'd',
    'b',
    'b',
    'c',
    'c',
    'd',
    'c',
    'c',
    'c',
    'a',
    'd',
    'c',
    'c',
    'c',
    'c',
    'd',
    'b',
    'a',
    'b',
    'b',
    'b',
    'c',
    'b',
    'b',
    'a',
    'b',
    'd',
    'd',
    'd',
    'a',
    'a',
    'd',
    'a',
    'a',
    'a',
    'b',
    'b',
    'a',
    'd',
    'd',
    'b',
    'c',
    'a',
    'c',
    'c',
    'a',
    'b',
    'd',
    'b',
    'a',
    'd',
    'b',
    'a',
    'b',
    'b',
    'd',
    'd',
    'a',
    'a',
    'b',
    'c',
    'b',
    'a',
    'd',
    'a',
    'b',
    'a',
    'b',
    'b',
    'a',
    'b',
    'a',
    'd'
  ];
  
  //اسئلة الاختبار الشامل
  static List<Question> qui = [
    Question(
        'عندما يكون المرسل مركزا حول نفسه و معتقدا ان ما هو بديهي له بديهي للمستقبل تسمى هذه الحالة بـ... '),
    Question('عملية التقاط الذبذبات الصوتية بدون انتباه تعرف بـ'),
    Question('النموذج العام لمكونات الاتصال يتكون من'),
    Question(
        'فهم الرسالة و استيعابها و الحكم عليها بالجودة او الرداءة و تمييز الصواب من الخطأ يعد مهارة'),
    Question('اشارة المرور تعد من الرموز '),
    Question(
        'مهارة مركبة يسهم فيها اتقان اللغة و القدرة على التلاعب بالاساليب'),
    Question(
        'المقدرة على الاستفادة من الخبرات السابقة و ربطها بالخبرات الجديدة هي من الشروط التي تتعلق بـ'),
    Question('من السمات الشخصية للمتحدث الناجح'),
    Question(
        'كذب العقدة النفسية سببه دوافع كريهة للنفس و للاخرين تم كبتها في اللاشعور'),
    Question('من ايجابيات الاتصال المكتوب'),
    Question(
        'توحيد الافكار و الاتجاهات و العمل على تغيير السلوك الانساني يعد من وظائف الاتصال '),
    Question(
        'اثناء تقديم المحاضر للعرض يوجد عوامل لها علاقة بالسلوك عليه تجنبها و منها'),
    Question('ما اعرفه عن نفسي و لا يعرفه الاخرون عني'),
    Question('ان الاطفال يتعلمون عن طريق الكتابة بنسبة'),
    Question('القدرة على تصنيف الافكار التي تعرض لها المتحدث'),
    Question('من شروط الاستماع'),
    Question('عندما يقوم المرسل بكبت اجزاء من رسالته'),
    Question('يجب تغيير السلوك لدى المستهدف بتزويده بالخبرات من وظائف الاتصال'),
    Question('من مهارات المتصل الخاصة'),
    Question('جميع ما ياتي من وظائف الاتصال ما عدا'),
    Question(
        'وسيلة لتزويد الناس بالاخبار الصحيحة التي تساعدهم في تكوين فكرة معينة'),
    Question(
        'اتصال يحدث بين شخص و اشخاص لا يعرفهم من تقنياته:راديو-سينما-...الخ'),
    Question('يستند الاتصال الفعال الى توافر اسس انسيابية ايجابية لدى'),
    Question(
        'المقدرة على تفسير المضمون و معرفة اهميته من الشروط التي تتعلق بـ'),
    Question('تعرف على انها ترجمة لحياة شخص معين و الاعمال التي قام بها'),
    Question('من الخصائص النفسية لنجاح الاتصال عند المستقبل'),
    Question('ادراك الافكار الاساسية للحديث مهارة من مهارات'),
    Question('تعد \"الابتسامة\"'),
    Question(
        'عملية تحسين استعمال اللغة و اضافة الوقفات المناسبة و التخلص من الاصوات الزائدة التي لا معنى لها'),
    Question('جميع ما يلي من خصائص المقال ما عدا'),
    Question(
        'ان نغمة الحبال الصوتية و الرنين و الالقاء تشكل نسبة من المصداقية تقدر بـ'),
    Question(
        'التقرير الذي يتضمن احصاء لحركة الادارة المالية هو من انواع التقرير'),
    Question(
        'اثناء تقديم عرض جيد هناك عوامل متعلقة بالاداء على المحاضر مراعاتها و منها'),
    Question('على الكاتب ان يكون واقعيا في عرضه الحقائق و الافكار اثناء إعداد'),
    Question('القدرة على التنبؤ بما سينتهي اليه الحديث مهارة من المهارات'),
    Question('المستمع يستطيع استيعاب و تحليل حوالي.......كلمة في الدقيقة'),
    Question('من سلبيات الاتصال المكتوب'),
    Question('النسبة التي نقضيها في التواصل مع الاخرين في حياتنا اليومية'),
    Question('احدى انواع الكذب يسمى بالكذب البريء'),
    Question('احد انواع المقال هو متنوع بين الادبي او العلمي او الاجتماعي'),
    Question('من كم عنصر يتكون الموقف الاتصالي'),
    Question('حتى تكون مستمع جيد '),
    Question('ما يمتلكه المتحدث لاقناع الاخرين من السمات'),
    Question('من اسس و قواعد العرض الناجح'),
    Question('من المبادئ المتعلقة بالكتابة الواضحة كل ما يلي ماعدا'),
    Question(
        'لغويا يعني الحمل و النقل ويمكن النظر اليه على انه اداة او وعاء يحمله بداخله عرض لمعلومات موجهة من احداث سابقة'),
    Question(
        'من العوامل الواجب توافرها من اجل تقديم عرض جيد عوامل لها علاقة ب الاداء منها'),
    Question('من اساليب التاكيد على النقاط المهمة كل ما يلي ماعدا'),
    Question('جميع ما يلي من انواع التقرير ماعدا'),
    Question('الاتصال عملية تربوية تتم بين'),
    Question('المصدر الاتصالي هو'),
    Question('جميع ما يلي يكون الموقف الاتصالي ماعدا'),
    Question('من المهارات العامة للمرسل'),
    Question('من الشروط الواجب توافرها من اجل ان يقوم ارجاع الاثر بوظيفته'),
    Question('ليست من عوامل الشخصية الواجب توافرها من اجل تقديم عرض جيد'),
    Question('من مهارات المستقبل الخاصة'),
    Question('من عوامل فهم الرسالة'),
    Question('ربط الاصوات بالايماءات الحسية والحركية للمتحدث'),
    Question('الاجابة عن سؤال ماذا'),
    Question(
        'عملية الاتصال لا تبدا عند المرسل و لا تنتهي عند المستقبل اي يعني'),
    Question('من المهارات الخاصة للمستقبل'),
    Question('اختر الخطأ\: من خطوات مرحلة توجيه الحديث'),
    Question('الاعداد للتحدث يتم بعد من المراحل'),
    Question(
        'عملية نقل المعلومات و الرغبات و المشاعر بهدف الاقناع او التاثير في السلوك'),
    Question('من سمات المتحدث الناجح'),
    Question('عرض شفوي او كتابي مستمر حول موضوع معين'),
    Question('بعض صور الطريقة الالقائية'),
    Question('اختر الخطأ\:من سمات المتحدث الناجح'),
    Question(
        'يلجأ اليه الطفل او المراهق ليتهم غيره باتهامات كاذبة يترتب عليها عقاب الاخر'),
    Question('عدد عناصر الالقاء'),
    Question('عرض شفوي او كتابي مستمر'),
    Question('الحالات الغير لفظية التي ترافق الحديث اللفظي'),
    Question('الصراع الذي يحدث في نفسك بين التمسك بالمبدأ او اتباع الشهوات'),
    Question('عدد انواع الكذب'),
    Question('خطوات الطريقة الالقائية'),
    Question('المرسل هو مصدر الرسالة و القائم بصياغتها حسب النموذج'),
    Question(
        'المعرفة الكافية باسلوب تصميم الرسالة بطريقة تجذب المستقبل و تمكنه من فهمها'),
    Question('من معوقات الاستماع الفعال'),
    Question('الوثائق الداخلية تتدفق عادة الى الافراد داخل المنظمة مثل'),
    Question('المقدرة على تفسير المضمون و معرفة اهميته من شروط'),
    Question(
        'قطعة نثرية محددة الطول و الموضوع و يشترط ان يكون التعبير صادق عن شخصية الكائن'),
    Question('يؤثر التفاعل غير اللفظي على الاستماع عن طريق'),
    Question('تقرير يخلو من الاراء و التعليقات و الاقتراحات'),
    Question(
        'تقرير يتضمن بعض العقبات التي حالت دون تنفيذ بعض الخطط و المشروعات'),
    Question('ان يكون قادر على التحليل و رؤية العلاقات من المهارات'),
    Question('يعد ربط الجديد المكتسب مع الخبرات السابقة من مهارات'),
    Question('يتعلم الاطفال عن طريق القراءة بنسبة'),
    Question('يتعلم الاطفال عن طريق الكلام بنسبة'),
    Question('يتعلم الاطفال عن طريق الاستماع بنسبة'),
    Question('يتعلم الاطفال عن طريق الكتابة بنسبة '),
    Question('عدد المبادئ المتعلقة بالكتابة التوضيحية '),
    Question('المقال الذي يتطلب مزاج عالي و ملائم'),
    Question('التقرير شكل من اشكال الاتصال الكتابي'),
    Question('تكون الاتصالات الكتابية اقل كلفة من الشفوية في حالة'),
    Question('نغمة الرنين و الحبال الصوتية تشكل نسبة ....... من المصداقية'),
    Question(
        'من الوسائل الميكانيكية التي نستخدمها للتاكيد على النقاط المهمة في الكتابة'),
    Question('يحمل ضياع في الجهود عندما تكون الكتابة غير جيدة بسبب'),
    Question('ليست من انواع التقارير حسب الموضوع'),
    Question('من اغراض الوثائق في المنظمات'),
    Question(
        'من مهارة اشراك المستمع ان الاطفال لا يستطيعون الانتباه للمعلومات المجردة اكثر من'),
    Question(
        'يعرف على انه تناقل للمعلومات و تبادلها باستخدام الكلمات و التصرفات غير الحرفية'),
    Question(
        'من صفات عملية الاتصال التي تتضمن التفاعل بين طرفين احدهما يؤثر بالاخر و يتاثر به'),
    Question('الاتصال عملية تربوية لانها تتم بين'),
    Question('الاتصال الشخصي يتم بين'),
    Question('نموذج لازويل يتضمن العناصر الاساسية لعملية الاتصال و عددها'),
    Question('المصدر الاتصالي في عملية الاتصال هو'),
    Question('من عناصر عملية الاتصال التشويش الدلالي و المقصود فيه'),
    Question('التغذية الراجعة او رجع الصدى هي'),
    Question('من وظائف عملية الاتصال تزويد الناس بالمعلومات المفيدة و هي'),
    Question('نستفيد من مهارات التواصل على الجانب الشخصي'),
    Question(
        'ان تركيزالانتباه على ما يسمعه الانسان من اجل تحقيق غرض معين و يقصد به'),
    Question('الانصات مهارة مكتسبة يعتمد على'),
    Question('من المؤثرات على مهارة الاستماع'),
    Question('من مهارات الاستماع الفرعية'),
    Question('من معوقات الاستماع الفعال الجسدية هي'),
    Question('حتى تكون مستمع جيد يجب عليك الاهتمام'),
    Question('حتى تكون مستمع جيد يجب عليك تجنب'),
    Question(
        'لتنمية مهارات الاستماع يقوم المدرب بعرض حوار معين او جزء من موضوع و يطلب من المتدربين'),
    Question('تشير الاحصائيات التي تتعلق بالاستماع الى ان الشخص'),
    Question(
        'توصل الباحثين نخبة من المعلمين حول ما يتعلمه الاطفال عن طريق الاستماع فكانت النسبة المئوية هي'),
    Question('من اسس تدريس الاستماع هي '),
    Question('يعد العرض الفعال احد الاساليب المهمة في نظام التعليم'),
    Question('من صفات الاهداف الخاصة في العرض الفعال ان تكون'),
    Question(
        'عند بدء العرض الفعال يوجد عوامل لها علاقة بالاداء على المحاضر مراعاتها اثناء العرض منها'),
    Question(
        'عند بدء العرض الفعال يوجد عوامل لها علاقة بالسلوك على المحاضر تجنب السلوكيات التالية و منها'),
    Question(
        'عند بدء العرض الفعال من العوامل الشخصية الواجب مراعاتها لزيادة انتباه المتلقي'),
    Question(
        'عند بدء العرض الفعال يوجد عوامل لها علاقة بلاحضور من الاقتراحات التي على المتحدث مراعاتها و منها'),
    Question('من اسس و قواعد العرض الناجح'),
    Question('تعبر عن بعض حركات الجسم و الاصوات المهملة و هي'),
    Question('من جوانب استعمال اللغة الشفوية'),
    Question('للنجاح في الاتصال في مهارة الاتصال الشفوي يجب'),
    Question('من مميزات مهارة التحدث'),
    Question('من سمات المتحدث الناجح'),
    Question(
        'بعض صور الطريقة الالقائية تعتمداساسا على كلام المعلم و تفسيراته و هي'),
    Question('سبب التوتر في بداية الالقاء هو'),
    Question(
        'ان نغمة حبالك الصوتية و الرنين و الالقاء تشكل نسبة مئوية من المصداقية عندما لا يستطيع الناس رؤيتك وهذه النسبة هي'),
    Question('من حالات ارتباط الاتصال غير اللفظي مع اللفظي'),
    Question(
        'يعتبر القول الذي لا يطابق الواقع مع تعمد الشخص بقصد تضليل الاخر او خداعه لاي سبب هو'),
    Question(
        'الطفل لا يستطيع التمييز بين ما يراه حقيقة و ما يدركه هو في مخيلته و المقصود فيه'),
    Question('يلجأ اليه الفرد بدافع اقصاء الشعور بالنقص او من اجل المفاخرة هو'),
  ];

  // exams answers
  static Map<String, Map<String, String>> exans = {
    '1': {
      'a': 'التواصل',
      'b': 'المهارة',
      'c': 'الاتصال الذاتي',
      'd': 'الاتصال'
    },
    '2': {
      'a': 'الاتصال عملية ديناميكية',
      'b': 'الاتصال عملية هادفة',
      'c': 'الاتصال عملية اجتماعية',
      'd': 'الاتصال عملية منظمة'
    },
    '3': {
      'a': 'معلم و مدير',
      'b': 'معلم و متعلم',
      'c': 'معلم و معلم',
      'd': 'معلم و موجه'
    },
    '4': {
      'a': 'الشخص ذاته',
      'b': 'شخص و شخص اخر',
      'c': 'مجموعة من الاشخاص متجانسين',
      'd': 'مجموعة اشخاص'
    },
    '5': {'a': '5 عناصر', 'b': '6 عناصر', 'c': '8 عناصر', 'd': '7 عناصر'},
    '6': {'a': 'الرسالة', 'b': 'قناة الاتصال', 'c': 'المستقبل', 'd': 'المرسل'},
    '7': {
      'a': 'عدم وصول الرسالة',
      'b': 'ترميز الرسالة',
      'c': 'الضوضاء',
      'd': 'سوء فهم لدى الشخص نفسه'
    },
    '8': {
      'a': 'اختيار الرسالة',
      'b': 'مدى قبول الرسالة',
      'c': 'صياغة الرسالة',
      'd': 'رموز الرسالة'
    },
    '9': {
      'a': 'وظيفة اجتماعية',
      'b': 'وظيفة تربوية',
      'c': 'وظيفة تثقيفية',
      'd': 'وظيفة فكرية دينية'
    },
    '10': {
      'a': 'التفريغ الانفعالي',
      'b': 'التعليم و التعلم',
      'c': 'في سوق العمل',
      'd': 'بالتدريب المهني'
    },
    '11': {
      'a': 'الاستماع',
      'b': 'السماع',
      'c': 'الانصات',
      'd': 'القراءة السريعة'
    },
    '12': {
      'a': 'تركيز الانتباه',
      'b': 'الاستماع الجيد',
      'c': 'تعتمد على الاصوات المنطوقة لا غير',
      'd': 'لغة الجسد'
    },
    '13': {
      'a': 'استخدام التقنيات الخاصة بالتركيز',
      'b': 'تقييم مضمون الرسالة',
      'c': 'الادراك',
      'd': 'البحث عن المعلومات'
    },
    '14': {
      'a': 'التواصل العيني',
      'b': 'مهارات الادراك و الاستيعاب',
      'c': 'لغة الجسد',
      'd': 'التواصل غير اللفظي'
    },
    '15': {
      'a': 'عدم التركيز',
      'b': 'الانانية',
      'c': 'الكذب',
      'd': 'التفكير السريع'
    },
    '16': {
      'a': 'التركيز على اللغة',
      'b': 'التعبيرات الوجهية',
      'c': 'التركيز على التفاصيل',
      'd': 'التركيز على اللهجة'
    },
    '17': {
      'a': 'تلافي العوامل المشتتة للانتباه',
      'b': 'الكذب',
      'c': 'الاستعانة باشخاص اخرين',
      'd': 'اسلوب المرسل'
    },
    '18': {
      'a': 'ذكر اسماء اشخاص الحوار',
      'b': 'ترتيب المشاعر التي اثارها الحوار',
      'c': 'توضيح المشاعر',
      'd': 'كل ما ذكر صحيح'
    },
    '19': {
      'a': 'يكتب ما يعادل كتابا كل شهر',
      'b': 'يكتب ما يعادل كتابا كل عام',
      'c': 'يكتب ما يعادل كتابا كل شهرين',
      'd': 'يكتب كل ما يعادل كتابا كل 3 اشهر'
    },
    '20': {'a': '25 %', 'b': '30 %', 'c': '18 %', 'd': '50 %'},
    '21': {
      'a': 'الطريقة',
      'b': 'التخلص من المشتتات الشعورية و اللاشعورية',
      'c': 'الاستراتيجية',
      'd': 'الاسلوب'
    },
    '22': {'a': 'التقليدي', 'b': 'التفاعلي', 'c': 'النشط', 'd': 'التشاركي'},
    '23': {
      'a': 'نظرية',
      'b': 'عملية',
      'c': 'نظرية و عملية',
      'd': 'قابلة للقياس و الملاحظة'
    },
    '24': {
      'a': 'التقيد بالوقت',
      'b': 'التحضير الجيد',
      'c': 'الدقة العلمية',
      'd': 'عدم حجب الرؤية عن الحضور'
    },
    '25': {
      'a': 'التكرار لفقرات و جمل',
      'b': 'التكرار لكلمات محددة',
      'c': 'التاكيد على فقرات او جمل',
      'd': 'حذف فقرات او جمل'
    },
    '26': {
      'a': 'سرعة الكلام',
      'b': 'البطء في الكلام',
      'c': 'الدقة في الكلام',
      'd': 'عدم التوتر في الكلام'
    },
    '27': {
      'a': 'قلد الاخرين',
      'b': 'لا تحاول تقليد الاخرين',
      'c': 'نمذج الاخرين',
      'd': 'تقمص شخصية الاخرين'
    },
    '28': {
      'a': 'البطء في العرض',
      'b': 'العرض المرئي',
      'c': 'البساطة',
      'd': 'سرعة العرض'
    },
    '29': {
      'a': 'الوضعية',
      'b': 'اللغة الطبيعية',
      'c': 'اللغة الاجتماعية',
      'd': 'لغة الجسد'
    },
    '30': {
      'a': 'الالفاظ المقبولة مهنيا',
      'b': 'الالفاظ المقبولة اقتصاديا',
      'c': 'الالفاظ المقبولة تعليميا',
      'd': 'الالفاظ المقبولة تربويا'
    },
    '31': {
      'a': 'بادر بالتحية',
      'b': 'قدم نفسك بواقعية',
      'c': 'خاطب محدثك باسمه',
      'd': 'كل ما سبق صحيح'
    },
    '32': {
      'a': 'اقل الطرق تكلفة و جهد',
      'b': 'سرعة الكلام',
      'c': 'التحدث بالتفاصيل الدقيقة',
      'd': 'التركيز على التفاصيل'
    },
    '33': {
      'a': 'سمات عمرية',
      'b': 'سمات صوتية',
      'c': 'سمات دينية',
      'd': 'سمات علمية'
    },
    '34': {'a': 'الشرح', 'b': 'التلقين', 'c': 'المحاضرة', 'd': 'الاستنتاج'},
    '35': {
      'a': 'القلق',
      'b': 'انزيم الادرينالين',
      'c': 'عدم الاهتمام',
      'd': 'عدم الرغبة بالالقاء'
    },
    '36': {'a': '55 %', 'b': '84 %', 'c': '36 %', 'd': '70 %'},
    '37': {
      'a': 'التكرار',
      'b': 'اللغة',
      'c': 'لغة الجسد',
      'd': 'مهارة التواصل'
    },
    '38': {'a': 'الاعلام المضلل', 'b': 'الخذلان', 'c': 'الاشاعة', 'd': 'الكذب'},
    '39': {
      'a': 'الكذب الالتباسي',
      'b': 'الغش',
      'c': 'الكذب بالعدوى',
      'd': 'العقدة النفسية'
    },
    '40': {
      'a': 'الكذب المزمن و اللاشعوري',
      'b': 'الكذب المتناقض',
      'c': 'الكذب الادعائي',
      'd': 'الكذب الخيالي'
    },
  };
  
  //أسئلة الدورة
  static List<Question> exams = [
    Question(
        'يعرف على انه تناقل للمعلومات و تبادلها باستخدام الكلمات و التصرفات غير الحرفية'),
    Question(
        'من صفات عملية الاتصال التي تتضمن التفاعل بين طرفين احدهما يؤثر بالاخر و يتاثر به'),
    Question('الاتصال عملية تربوية لانها تتم بين'),
    Question('الاتصال الشخصي يتم بين'),
    Question('نموذج لازويل يتضمن العناصر الاساسية لعملية الاتصال و عددها'),
    Question('المصدر الاتصالي في عملية الاتصال هو'),
    Question('من عناصر عملية الاتصال التشويش الدلالي و المقصود فيه'),
    Question('التغذية الراجعة او رجع الصدى هي'),
    Question('من وظائف عملية الاتصال تزويد الناس بالمعلومات المفيدة و هي'),
    Question('نستفيد من مهارات التواصل على الجانب الشخصي'),
    Question(
        'ان تركيزالانتباه على ما يسمعه الانسان من اجل تحقيق غرض معين و يقصد به'),
    Question('الانصات مهارة مكتسبة يعتمد على'),
    Question('من المؤثرات على مهارة الاستماع'),
    Question('من مهارات الاستماع الفرعية'),
    Question('من معوقات الاستماع الفعال الجسدية هي'),
    Question('حتى تكون مستمع جيد يجب عليك الاهتمام'),
    Question('حتى تكون مستمع جيد يجب عليك تجنب'),
    Question(
        'لتنمية مهارات الاستماع يقوم المدرب بعرض حوار معين او جزء من موضوع و يطلب من المتدربين'),
    Question('تشير الاحصائيات التي تتعلق بالاستماع الى ان الشخص'),
    Question(
        'توصل الباحثين نخبة من المعلمين حول ما يتعلمه الاطفال عن طريق الاستماع فكانت النسبة المئوية هي'),
    Question('من اسس تدريس الاستماع هي '),
    Question('يعد العرض الفعال احد الاساليب المهمة في نظام التعليم'),
    Question('من صفات الاهداف الخاصة في العرض الفعال ان تكون'),
    Question(
        'عند بدء العرض الفعال يوجد عوامل لها علاقة بالاداء على المحاضر مراعاتها اثناء العرض منها'),
    Question(
        'عند بدء العرض الفعال يوجد عوامل لها علاقة بالسلوك على المحاضر تجنب السلوكيات التالية و منها'),
    Question(
        'عند بدء العرض الفعال من العوامل الشخصية الواجب مراعاتها لزيادة انتباه المتلقي'),
    Question(
        'عند بدء العرض الفعال يوجد عوامل لها علاقة بلاحضور من الاقتراحات التي على المتحدث مراعاتها و منها'),
    Question('من اسس و قواعد العرض الناجح'),
    Question('تعبر عن بعض حركات الجسم و الاصوات المهملة و هي'),
    Question('من جوانب استعمال اللغة الشفوية'),
    Question('للنجاح في الاتصال في مهارة الاتصال الشفوي يجب'),
    Question('من مميزات مهارة التحدث'),
    Question('من سمات المتحدث الناجح'),
    Question(
        'بعض صور الطريقة الالقائية تعتمداساسا على كلام المعلم و تفسيراته و هي'),
    Question('سبب التوتر في بداية الالقاء هو'),
    Question(
        'ان نغمة حبالك الصوتية و الرنين و الالقاء تشكل نسبة مئوية من المصداقية عندما لا يستطيع الناس رؤيتك وهذه النسبة هي'),
    Question('من حالات ارتباط الاتصال غير اللفظي مع اللفظي'),
    Question(
        'يعتبر القول الذي لا يطابق الواقع مع تعمد الشخص بقصد تضليل الاخر او خداعه لاي سبب هو'),
    Question(
        'الطفل لا يستطيع التمييز بين ما يراه حقيقة و ما يدركه هو في مخيلته و المقصود فيه'),
    Question('يلجأ اليه الفرد بدافع اقصاء الشعور بالنقص او من اجل المفاخرة هو'),
  ];
  
  //الاجوبة الصحيحة للدورة
  static List<String> correctanswers = [
    'a',
    'a',
    'b',
    'b',
    'a',
    'd',
    'd',
    'b',
    'c',
    'a',
    'c',
    'c',
    'a',
    'b',
    'd',
    'b',
    'a',
    'd',
    'b',
    'a',
    'b',
    'b',
    'd',
    'd',
    'a',
    'a',
    'b',
    'c',
    'b',
    'a',
    'd',
    'a',
    'b',
    'a',
    'b',
    'b',
    'a',
    'b',
    'a',
    'd'
  ];
}
